In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("https://raw.githubusercontent.com/Datamanim/datarepo/main/youtube/youtube.csv",index_col=0)

In [3]:
df.head()

,title,channelTitle,categoryId,view_count,likes,dislikes,comment_count,channelId,trending_date2
0,[신병] 물자창고,장삐쭈,23,1893473,38249,730,8595,UChbE5OZQ6dRHECsX0tEPEZQ,2021-01-01
1,RAIN(비) - 나로 바꾸자 Switch to me (duet with JYP) MV,RAIN's Official Channel,10,2600864,0,0,20129,UCxXgIeE5hxWxHG6dz9Scg2w,2021-01-01
2,2020년 제야의 종 온라인 타종행사 | 보신각 현장 행사는 진행하지 않습니다.,서울시 · Seoul,29,347049,3564,120,178,UCZUPZW5idAxYp-Asj__lVAA,2021-01-01
3,고기남자의 칠면조 파티,고기남자 MeatMan,26,528458,15372,280,3470,UCT3CumbFIJiW33uq0UI3zlg,2021-01-01
4,골목 3mc를 분노하게 만든 마음고생이 심했을 공릉 백반집 사장님의 푸념?! [예능...,스브스밥집,24,494904,3918,111,3142,UCdWgRSfttvDucq4ApcCg5Mw,2021-01-01

In [32]:
# Question 1
#인기동영상 제작횟수가 많은 채널 상위 10개명을 출력하라 (날짜기준, 중복포함)
answer = df.loc[df.channelId.isin(df.channelId.value_counts(ascending=False).head(10).index),'channelTitle'].values
print(answer)

['장삐쭈' '총몇명' '파뿌리' ... '엠뚜루마뚜루 : MBC 공식 종합 채널' '런닝맨 - 스브스 공식 채널' '파뿌리']

In [33]:
# Question 2
#논란으로 인기동영상이 된 케이스를 확인하고 싶다. dislikes수가 like 수보다 높은 동영상을 제작한 채널을 모두 출력하라
answer = list(df.loc[df.dislikes>df.likes,"channelTitle"].unique())
print(answer)

['핫도그TV', 'ASMR 애정TV', '하얀트리HayanTree', '양팡 YangPang', '철구형 (CHULTUBE)', '왜냐맨하우스', '(MUTUBE)와꾸대장봉준', '오메킴TV', '육지담', 'MapleStory_KR', 'ROAD FIGHTING CHAMPIONSHIP', '사나이 김기훈', '나혼자산다 STUDIO', 'Gen.G esports']

In [66]:
# Question 3
#채널명을 바꾼 케이스가 있는지 확인하고 싶다. channelId의 경우 고유값이므로 이를 통해 채널명을 한번이라도 바꾼 채널의 갯수를 구하여라

temp = df.groupby('channelId')['channelTitle'].apply(lambda x: x.unique().size)

In [67]:
answer = temp.loc[temp.values>1].size
print(answer)

71

In [68]:
# Question 4
#일요일에 인기있었던 영상들중 가장많은 영상 종류(categoryId)는 무엇인가?
import datetime as dt

In [93]:
df["weekday"] = pd.to_datetime(df.trending_date2).dt.day_name()

In [94]:
answer = df.loc[df.weekday=='Sunday', 'categoryId'].value_counts(ascending=False).head(1).index[0]
print(answer)

24

In [121]:
# Question 5
#각 요일별 인기 영상들의 categoryId는 각각 몇개 씩인지 하나의 데이터 프레임으로 표현하라

In [129]:
pd.crosstab(df.categoryId, df.weekday)

weekday     Friday  Monday  Saturday  Sunday  Thursday  Tuesday  Wednesday
categoryId
1              243     263       255     274       246      257        234
2              120     105       119      99       128      119        129
10             833     837       776     830       890      894        917
15             187     215       198     217       207      208        207
17             633     668       592     636       682      708        706
19              90      92        87      91        92       89         85
20             283     298       296     289       282      285        291
22            1288    1373      1289    1337      1341     1375       1333
23             568     594       570     556       560      569        566
24            2976    3148      3066    3096      2954     3084       3090
25             444     453       422     437       470      452        468
26             369     378       364     363       375      394        385
27             183     205       183     199       194      194        212
28             171     160       173     167       166      161        165
29              12      10        10       9        13       11         12

In [130]:
#Q5 
#댓글의 수로 (comment_count) 영상 반응에 대한 판단을 할 수 있다. viewcount대비 댓글수가 가장 높은 영상을 확인하라 (view_count값이 0인 경우는 제외한다)

In [131]:
df.head()

,title,channelTitle,categoryId,view_count,likes,dislikes,comment_count,channelId,trending_date2,weekday
0,[신병] 물자창고,장삐쭈,23,1893473,38249,730,8595,UChbE5OZQ6dRHECsX0tEPEZQ,2021-01-01,Friday
1,RAIN(비) - 나로 바꾸자 Switch to me (duet with JYP) MV,RAIN's Official Channel,10,2600864,0,0,20129,UCxXgIeE5hxWxHG6dz9Scg2w,2021-01-01,Friday
2,2020년 제야의 종 온라인 타종행사 | 보신각 현장 행사는 진행하지 않습니다.,서울시 · Seoul,29,347049,3564,120,178,UCZUPZW5idAxYp-Asj__lVAA,2021-01-01,Friday
3,고기남자의 칠면조 파티,고기남자 MeatMan,26,528458,15372,280,3470,UCT3CumbFIJiW33uq0UI3zlg,2021-01-01,Friday
4,골목 3mc를 분노하게 만든 마음고생이 심했을 공릉 백반집 사장님의 푸념?! [예능...,스브스밥집,24,494904,3918,111,3142,UCdWgRSfttvDucq4ApcCg5Mw,2021-01-01,Friday

In [502]:
import pandas as pd
import datetime as dt

channel =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/youtube/channelInfo.csv')
video =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/youtube/videoInfo.csv')
display(channel.head())
display(video.head())

,channelid,subcnt,viewcnt,videocnt,ct,channelname
0,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,410238653,736,2021-09-30 03:01:03,꽈뚜룹
1,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,736,2021-09-30 09:01:03,꽈뚜룹
2,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,735,2021-09-30 15:01:03,꽈뚜룹
3,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,737,2021-09-30 21:01:03,꽈뚜룹
4,UCkQCwnkQfgSuPTTnw_Y7v7w,1320000,412531322,737,2021-10-01 03:01:04,꽈뚜룹

,videopk,viewcnt,likecnt,dislikecnt,favoritecnt,cmcnt,ct,videoname
0,c5JQp6xafqc,1667010,30474,706,0,6587,2021-10-10 15:20:03,공범 EP1
1,c5JQp6xafqc,1669089,30495,707,0,6589,2021-10-10 15:30:03,공범 EP1
2,c5JQp6xafqc,1674759,30522,711,0,6596,2021-10-10 15:40:02,공범 EP1
3,c5JQp6xafqc,1677026,30555,712,0,6604,2021-10-10 15:50:03,공범 EP1
4,c5JQp6xafqc,1681824,30585,713,0,6600,2021-10-10 16:00:03,공범 EP1

In [506]:
video.ct = pd.to_datetime(video.ct, format='%Y-%m-%dT%H:%M:%S')
channel.ct = pd.to_datetime(channel.ct, format='%Y-%m-%dT%H:%M:%S')

In [455]:
# video.ct = pd.to_datetime(video.ct)
# channel.ct = pd.to_datetime(channel.ct)

# video.ct = pd.to_datetime(video.ct)
# video.ct = video.ct.apply(lambda x: dt.datetime.strptime(x.isoformat(), '%Y-%m-%dT%H:%M:%S'))

# channel.ct = pd.to_datetime(channel.ct)
# channel.ct = channel.ct.apply(lambda x: dt.datetime.strptime(x.isoformat(), '%Y-%m-%dT%H:%M:%S'))

In [507]:
video.videoname.value_counts()

 공범 EP1    3492
 공범 EP2    3204
 공범 EP3    2568
 공범 EP4    2280
 공범 EP5    1562
 공범 EP6    1274
 공범 EP7     555
 공범 EP8     266
Name: videoname, dtype: int64

In [508]:
video_ct = video.groupby(['videoname'])['ct'].max().reset_index()

In [509]:
pd.merge(left=video_ct, right=video.loc[:,['viewcnt','videoname','ct']], left_on=['videoname','ct'], right_on=['videoname','ct'])

  videoname                  ct  viewcnt
0    공범 EP1 2021-11-01 15:30:03  3180532
1    공범 EP2 2021-11-01 15:30:03  2199328
2    공범 EP3 2021-11-01 15:30:03  1671294
3    공범 EP4 2021-11-01 15:30:03  1818493
4    공범 EP5 2021-11-01 15:30:04  1503435
5    공범 EP6 2021-11-01 15:30:04  1750222
6    공범 EP7 2021-11-01 15:30:05  1630200
7    공범 EP8 2021-11-01 15:30:05  1289088

In [510]:
video.loc[:,['viewcnt','videoname','ct']].sort_values(by='ct',ascending=False).drop_duplicates(subset='videoname').sort_values(by='videoname',ascending=True).reset_index(drop=True)

   viewcnt videoname                  ct
0  3180532    공범 EP1 2021-11-01 15:30:03
1  2199328    공범 EP2 2021-11-01 15:30:03
2  1671294    공범 EP3 2021-11-01 15:30:03
3  1818493    공범 EP4 2021-11-01 15:30:03
4  1503435    공범 EP5 2021-11-01 15:30:04
5  1750222    공범 EP6 2021-11-01 15:30:04
6  1630200    공범 EP7 2021-11-01 15:30:05
7  1289088    공범 EP8 2021-11-01 15:30:05

In [511]:
#Question 13

#Channel 데이터중 2021-10-03일 이후 각 채널의 처음 기록 됐던 구독자 수(subcnt)를 출력하라

In [512]:
channel.head()

,channelid,subcnt,viewcnt,videocnt,ct,channelname
0,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,410238653,736,2021-09-30 03:01:03,꽈뚜룹
1,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,736,2021-09-30 09:01:03,꽈뚜룹
2,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,735,2021-09-30 15:01:03,꽈뚜룹
3,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,737,2021-09-30 21:01:03,꽈뚜룹
4,UCkQCwnkQfgSuPTTnw_Y7v7w,1320000,412531322,737,2021-10-01 03:01:04,꽈뚜룹

In [513]:
channel.loc[channel['ct']>(pd.to_datetime('2021-10-03')),:].sort_values(by=['ct','channelname'],ascending=True).drop_duplicates(subset='channelname').loc[:,['channelname','subcnt']].reset_index(drop=True)

        channelname   subcnt
0            논리왕 전기   922000
1             야전삽짱재   257000
2        츄정ChuJeong   322000
3        김농밀의 농밀한 삶     7520
4       릴펄 Lilpearl    10100
5   와글와글 WagleWagle    55000
6               조나단   215000
7           형사!탐정되다    14900
8     Balming Tiger    54300
9     곽토리 kwak tori   471000
10              꽈뚜룹  1330000

In [514]:
#Question 14

#각채널의 2021-10-03 03:00:00 ~ 2021-11-01 15:00:00 까지 구독자수 (subcnt) 의 증가량을 구하여라

In [515]:
channel.head()

,channelid,subcnt,viewcnt,videocnt,ct,channelname
0,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,410238653,736,2021-09-30 03:01:03,꽈뚜룹
1,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,736,2021-09-30 09:01:03,꽈뚜룹
2,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,735,2021-09-30 15:01:03,꽈뚜룹
3,UCkQCwnkQfgSuPTTnw_Y7v7w,1310000,412531322,737,2021-09-30 21:01:03,꽈뚜룹
4,UCkQCwnkQfgSuPTTnw_Y7v7w,1320000,412531322,737,2021-10-01 03:01:04,꽈뚜룹

In [516]:
filtered_channel = channel.loc[(channel.ct>=pd.to_datetime('2021-10-03 03:00:00'))
                               &(channel.ct<=pd.to_datetime('2021-11-01 15:00:00'))]

In [517]:
ct_min = filtered_channel.groupby(['channelname'])['ct'].min().reset_index().sort_values(by='channelname',ascending=False).reset_index(drop=True)

In [518]:
ct_max = filtered_channel.groupby(['channelname'])['ct'].max().reset_index().sort_values(by='channelname',ascending=False).reset_index(drop=True)

In [519]:
ct_min_full_data = pd.merge(left=ct_min, right=filtered_channel.loc[:,['channelname','ct','subcnt']], left_on=['channelname','ct'],right_on=['channelname','ct'])

In [520]:
ct_max_full_data = pd.merge(left=ct_max, right=filtered_channel.loc[:,['channelname','ct','subcnt']], left_on=['channelname','ct'],right_on=['channelname','ct'])

In [521]:
answer = pd.concat([ct_min_full_data.channelname, (ct_max_full_data['subcnt']-ct_min_full_data['subcnt'])],axis=1).sort_values(by='channelname',ascending=False)

In [522]:
display(answer)

        channelname  subcnt
0           형사!탐정되다   10300
1        츄정ChuJeong    1000
2               조나단   12000
3   와글와글 WagleWagle       0
4             야전삽짱재   11000
5       릴펄 Lilpearl   11000
6            논리왕 전기  -11000
7               꽈뚜룹   70000
8        김농밀의 농밀한 삶    1540
9     곽토리 kwak tori   -2000
10    Balming Tiger    2500

In [523]:
# Question 15
# 각 비디오는 10분 간격으로 구독자수, 좋아요, 싫어요수, 댓글수가 수집된것으로 알려졌다. 
# 공범 EP1의 비디오정보 데이터중 수집간격이 5분 이하, 20분이상인 데이터 구간( 해당 시점 전,후)의 
# 시각을 모두 출력하라

# video_ep1 = video.loc[video.videoname==video.iloc[0,-1],:]
# video_ep1.sort_values(by='ct',inplace=True)
# video_ep1['ct_previous'] = pd.to_datetime(0)
# video_ep1.iloc[1:,-1] =  video_ep1.iloc[0:-1,-3].values
# video_ep1['time_delta'] = video_ep1.ct-video_ep1.ct_previous
# video_ep1.time_delta.iloc[0] = dt.timedelta(minutes=10)
# iregular_video_ep1 = video_ep1.loc[(video_ep1.time_delta<=dt.timedelta(minutes=5))|
#                                    (video_ep1.time_delta>=dt.timedelta(minutes=20)),]
# for num in iregular_video_ep1.index:
#     iregular_video_ep1=iregular_video_ep1.append(video_ep1.iloc[num+1,:],)
#     iregular_video_ep1=iregular_video_ep1.append(video_ep1.iloc[num-1,:],)
# answer = iregular_video_ep1.drop_duplicates().sort_index()
# display(answer)

In [615]:
video.head()

,videopk,viewcnt,likecnt,dislikecnt,favoritecnt,cmcnt,ct,videoname
0,c5JQp6xafqc,1667010,30474,706,0,6587,2021-10-10 15:20:03,공범 EP1
1,c5JQp6xafqc,1669089,30495,707,0,6589,2021-10-10 15:30:03,공범 EP1
2,c5JQp6xafqc,1674759,30522,711,0,6596,2021-10-10 15:40:02,공범 EP1
3,c5JQp6xafqc,1677026,30555,712,0,6604,2021-10-10 15:50:03,공범 EP1
4,c5JQp6xafqc,1681824,30585,713,0,6600,2021-10-10 16:00:03,공범 EP1

In [616]:
video_ep1 = video.loc[video.videoname==video.iloc[0,-1],:]

In [617]:
video_ep1.sort_values(by='ct',inplace=True)

C:\Users\yuvjj\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [618]:
video_ep1['ct_previous'] = pd.to_datetime(0)

C:\Users\yuvjj\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [619]:
video_ep1.iloc[1:,-1] =  video_ep1.iloc[0:-1,-3].values

C:\Users\yuvjj\Anaconda3\lib\site-packages\pandas\core\indexing.py:494: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self.obj[item] = s

In [620]:
video_ep1['time_delta'] = video_ep1.ct-video_ep1.ct_previous

C:\Users\yuvjj\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [621]:
video_ep1.time_delta.iloc[0] = dt.timedelta(minutes=10)

C:\Users\yuvjj\Anaconda3\lib\site-packages\pandas\core\indexing.py:205: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self._setitem_with_indexer(indexer, value)
C:\Users\yuvjj\Anaconda3\lib\site-packages\ipykernel_launcher.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """Entry point for launching an IPython kernel.

In [622]:
iregular_video_ep1 = video_ep1.loc[(video_ep1.time_delta<=dt.timedelta(minutes=5))|(video_ep1.time_delta>=dt.timedelta(minutes=20)),]

In [623]:
for num in iregular_video_ep1.index:
    iregular_video_ep1=iregular_video_ep1.append(video_ep1.iloc[num+1,:],)
    iregular_video_ep1=iregular_video_ep1.append(video_ep1.iloc[num-1,:],)

In [624]:
answer = iregular_video_ep1.drop_duplicates().sort_index()

In [625]:
display(answer)

,videopk,viewcnt,likecnt,dislikecnt,favoritecnt,cmcnt,ct,videoname,ct_previous,time_delta
720,c5JQp6xafqc,2153676,34104,830,0,7120,2021-10-12 19:20:03,공범 EP1,2021-10-12 19:10:02,00:10:01
721,c5JQp6xafqc,2228250,34559,849,0,7191,2021-10-13 09:41:37,공범 EP1,2021-10-12 19:20:03,14:21:34
722,c5JQp6xafqc,2228250,34559,849,0,7191,2021-10-13 09:41:37,공범 EP1,2021-10-13 09:41:37,00:00:00
723,c5JQp6xafqc,2228669,34566,849,0,7194,2021-10-13 09:50:03,공범 EP1,2021-10-13 09:41:37,00:08:26
1635,c5JQp6xafqc,2706691,37893,987,0,7410,2021-10-19 17:50:02,공범 EP1,2021-10-19 17:40:02,00:10:00
1636,c5JQp6xafqc,2707933,37901,988,0,7410,2021-10-19 18:20:03,공범 EP1,2021-10-19 17:50:02,00:30:01
1637,c5JQp6xafqc,2708448,37903,988,0,7410,2021-10-19 18:30:03,공범 EP1,2021-10-19 18:20:03,00:10:00

In [626]:
# Question 16
# 각 에피소드의 시작날짜(년-월-일)를 에피소드 이름과 묶어 데이터 프레임으로 만들고 출력하라

In [632]:
video_start = video.groupby('videoname')['ct'].min().reset_index()

In [637]:
video_start.ct = video_start.ct.dt.date

In [638]:
display(video_start)

  videoname          ct
0    공범 EP1  2021-10-07
1    공범 EP2  2021-10-09
2    공범 EP3  2021-10-14
3    공범 EP4  2021-10-16
4    공범 EP5  2021-10-21
5    공범 EP6  2021-10-23
6    공범 EP7  2021-10-28
7    공범 EP8  2021-10-30

In [639]:
# Question 17
# 공범” 컨텐츠의 경우 19:00시에 공개 되는것으로 알려져있다. 
# 공개된 날의 21시의 viewcnt, ct, videoname 으로 구성된 데이터 프레임을 viewcnt를 
# 내림차순으로 정렬하여 출력하라

In [649]:
video['hour'] = video.ct.dt.hour

In [650]:
video.head()

,videopk,viewcnt,likecnt,dislikecnt,favoritecnt,cmcnt,ct,videoname,hour
0,c5JQp6xafqc,1667010,30474,706,0,6587,2021-10-10 15:20:03,공범 EP1,15
1,c5JQp6xafqc,1669089,30495,707,0,6589,2021-10-10 15:30:03,공범 EP1,15
2,c5JQp6xafqc,1674759,30522,711,0,6596,2021-10-10 15:40:02,공범 EP1,15
3,c5JQp6xafqc,1677026,30555,712,0,6604,2021-10-10 15:50:03,공범 EP1,15
4,c5JQp6xafqc,1681824,30585,713,0,6600,2021-10-10 16:00:03,공범 EP1,16

In [666]:
answer = video.loc[video.hour==21,].sort_values(by='ct').drop_duplicates('videoname').loc[:,['viewcnt','ct','videoname']].sort_values(by='viewcnt',ascending=False)
display(answer)

       viewcnt                  ct videoname
14945   264029 2021-10-30 21:00:08    공범 EP8
13117   252032 2021-10-28 21:00:04    공범 EP7
9275    217674 2021-10-16 21:00:04    공범 EP4
13672   213899 2021-10-23 21:00:06    공범 EP6
11555   201179 2021-10-21 21:00:04    공범 EP5
3507    148144 2021-10-09 21:00:03    공범 EP2
6707    147183 2021-10-14 21:00:04    공범 EP3
21      117340 2021-10-07 21:00:03    공범 EP1

In [667]:
# Question 18

# video 정보의 가장 최근 데이터들에서 각 에피소드의 싫어요/좋아요 비율을 ratio 컬럼으로 만들고 
# videoname, ratio로 구성된 데이터 프레임을 ratio를 오름차순으로 정렬하라

In [671]:
filtered_video = video.sort_values(by='ct',ascending=False).drop_duplicates('videoname')

In [672]:
filtered_video['ratio'] = filtered_video.dislikecnt/filtered_video.likecnt

In [675]:
filtered_video.loc[:,['videoname','ratio']].sort_values(by='ratio',ascending=True)

      videoname     ratio
13660    공범 EP7  0.013636
14934    공범 EP6  0.015881
11543    공범 EP4  0.017971
13105    공범 EP5  0.021128
9263     공범 EP3  0.022360
3491     공범 EP1  0.027118
6695     공범 EP2  0.029844
15200    공범 EP8  0.141357

In [677]:
# Question 19

# 2021-11-01 00:00:00 ~ 15:00:00까지 각 에피소드별 viewcnt의 증가량을 데이터 프레임으로 만드시오
filtered_video = video.loc[(video.ct>=pd.to_datetime('2021-11-01 00:00:00'))&
                          (video.ct<=pd.to_datetime('2021-11-01 15:00:00')),:]

In [707]:
filtered_video_group = filtered_video.groupby(['videoname']).apply(lambda x: x.loc[((x.ct)==(x.ct.max())),'viewcnt'].values[0] - x.loc[((x.ct)==(x.ct.min())),'viewcnt'].values[0])

In [713]:
answer = filtered_video_group.reset_index().rename(columns={0:'increased viewcnt'})
display(answer)

  videoname  increased viewcnt
0    공범 EP1              13298
1    공범 EP2              10300
2    공범 EP3               9927
3    공범 EP4               9824
4    공범 EP5              10824
5    공범 EP6              14141
6    공범 EP7              26949
7    공범 EP8              89147

In [714]:
# Question 20

# video 데이터 중에서 중복되는 데이터가 존재한다. 중복되는 각 데이터의 시간대와 videoname 을 구하여라

In [717]:
video[[False for x in range(0,video.shape[0])]]

Empty DataFrame
Columns: [videopk, viewcnt, likecnt, dislikecnt, favoritecnt, cmcnt, ct, videoname, hour]
Index: []

In [723]:
video.drop(labels=video.drop_duplicates().index).loc[:,["videoname",'ct']]

     videoname                  ct
722     공범 EP1 2021-10-13 09:41:37
3927    공범 EP2 2021-10-13 09:41:37

In [737]:
video[video.index.isin(set(video.index)-set(video.drop_duplicates().index))].loc[:,['videoname','ct']]

     videoname                  ct
722     공범 EP1 2021-10-13 09:41:37
3927    공범 EP2 2021-10-13 09:41:37

In [738]:
video

,videopk,viewcnt,likecnt,dislikecnt,favoritecnt,cmcnt,ct,videoname,hour
0,c5JQp6xafqc,1667010,30474,706,0,6587,2021-10-10 15:20:03,공범 EP1,15
1,c5JQp6xafqc,1669089,30495,707,0,6589,2021-10-10 15:30:03,공범 EP1,15
2,c5JQp6xafqc,1674759,30522,711,0,6596,2021-10-10 15:40:02,공범 EP1,15
3,c5JQp6xafqc,1677026,30555,712,0,6604,2021-10-10 15:50:03,공범 EP1,15
4,c5JQp6xafqc,1681824,30585,713,0,6600,2021-10-10 16:00:03,공범 EP1,16
...,...,...,...,...,...,...,...,...,...
15196,yZt-h-KcmUE,1285474,25582,3615,0,31603,2021-11-01 14:50:06,공범 EP8,14
15197,yZt-h-KcmUE,1286376,25592,3617,0,31627,2021-11-01 15:00:05,공범 EP8,15
15198,yZt-h-KcmUE,1287172,25597,3619,0,31643,2021-11-01 15:10:05,공범 EP8,15
15199,yZt-h-KcmUE,1288138,25606,3619,0,31648,2021-11-01 15:20:04,공범 EP8,15
15200,yZt-h-KcmUE,1289088,25616,3621,0,31663,2021-11-01 15:30:05,공범 EP8,15

In [739]:
import pandas as pd

df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/worldcup/worldcupgoals.csv')
df.head()

           Player  Goals                Years  Country
0  Miroslav Klose     16  2002-2006-2010-2014  Germany
1         Ronaldo     15       1998-2002-2006   Brazil
2     Gerd Muller     14            1970-1974  Germany
3   Just Fontaine     13                 1958   France
4            Pele     12  1958-1962-1966-1970   Brazil

In [740]:
# Question 21

# 주어진 전체 기간의 각 나라별 골득점수 상위 5개 국가와 그 득점수를 데이터프레임형태로 출력하라

In [755]:
df.groupby('Country')['Goals'].sum().reset_index().sort_values(by='Goals', ascending=False).head(5)

      Country  Goals
8      Brazil    228
25    Germany    226
2   Argentina    135
36      Italy    123
24     France    115

In [756]:
# Question 22

# 주어진 전체기간동안 골득점을 한 선수가 가장 많은 나라 상위 5개 국가와 
# 그 선수 숫자를 데이터 프레임 형식으로 출력하라

In [767]:
df.Country.value_counts().reset_index().head(5)

       index  Country
0     Brazil       81
1    Germany       78
2      Italy       60
3  Argentina       59
4     France       58

In [768]:
# Question 23

# Years 컬럼은 년도 -년도 형식으로 구성되어있고, 각 년도는 4자리 숫자이다. 
# 년도 표기가 4자리 숫자로 안된 케이스가 존재한다. 해당 건은 몇건인지 출력하라

In [783]:
df['Years_list']=df.Years.apply(lambda x: x.split('-'))

In [784]:
df['ireg_years'] = df.Years_list.apply(lambda x: sum([len(a) for a in x])%4)

In [786]:
df.loc[df.ireg_years!=0,].shape[0]

45

In [ ]:
# Question 24

# **Q23에서 발생한 예외 케이스를 제외한 데이터프레임을 df2라고 정의하고 데이터의 행의 숫자를 출력하라 
# (아래 문제부터는 df2로 풀이하겠습니다) **

In [791]:
df.head()

,Player,Goals,Years,Country,Years_list,ireg_years
0,Miroslav Klose,16,2002-2006-2010-2014,Germany,"[2002, 2006, 2010, 2014]",0
1,Ronaldo,15,1998-2002-2006,Brazil,"[1998, 2002, 2006]",0
2,Gerd Muller,14,1970-1974,Germany,"[1970, 1974]",0
3,Just Fontaine,13,1958,France,[1958],0
4,Pele,12,1958-1962-1966-1970,Brazil,"[1958, 1962, 1966, 1970]",0

In [793]:
df2 = df.drop(labels=(df.loc[df.ireg_years!=0,df.columns[0:-2]]).index)

In [794]:
df2.shape[0]

1250

In [795]:
# Question 25

# 월드컵 출전횟수를 나타내는 ‘LenCup’ 컬럼을 추가하고 4회 출전한 선수의 숫자를 구하여라

In [810]:
df2['LenCup'] = df2.apply(lambda x: len(x["Years_list"]),axis=1)

In [811]:
df2.loc[df2.LenCup==4,].shape[0]

16

In [803]:
# Question 26

# Yugoslavia 국가의 월드컵 출전횟수가 2회인 선수들의 숫자를 구하여라

In [804]:
df2.loc[(df2.Country=='Yugoslavia')&(df2.LenCup==2)].shape[0]

7

In [805]:
# Question 27

# 2002년도에 출전한 전체 선수는 몇명인가?

In [830]:
(df2.apply(lambda x: '2002' in x['Years_list'], axis=1)+0).sum()

156

In [832]:
# Question 28

# 이름에 ‘carlos’ 단어가 들어가는 선수의 숫자는 몇 명인가? (대, 소문자 구분 x)

In [856]:
((df2['Player'].apply(lambda x: 'carlos' in x.lower()))+0).sum()

13

In [857]:
# Question 29

# 월드컵 출전 횟수가 1회뿐인 선수들 중에서 가장 많은 득점을 올렸던 선수는 누구인가?

In [858]:
df2.head()

,Player,Goals,Years,Country,Years_list,ireg_years,LenCup
0,Miroslav Klose,16,2002-2006-2010-2014,Germany,"[2002, 2006, 2010, 2014]",0,4
1,Ronaldo,15,1998-2002-2006,Brazil,"[1998, 2002, 2006]",0,3
2,Gerd Muller,14,1970-1974,Germany,"[1970, 1974]",0,2
3,Just Fontaine,13,1958,France,[1958],0,1
4,Pele,12,1958-1962-1966-1970,Brazil,"[1958, 1962, 1966, 1970]",0,4

In [860]:
df2.loc[df2.LenCup==1,].sort_values(by='Goals',ascending=False).head(1)

          Player  Goals Years Country Years_list  ireg_years  LenCup
3  Just Fontaine     13  1958  France     [1958]           0       1

In [874]:
rank = df2.loc[df2.LenCup==1,['Goals']].rank(method='min', ascending=False)
rank_index = rank.loc[rank.Goals==1].index
df2.iloc[rank_index,0].values

array(['Just Fontaine'], dtype=object)

In [876]:
# Question 30

# 월드컵 출전횟수가 1회 뿐인 선수들이 가장 많은 국가는 어디인가

In [896]:
rank = df2.loc[df2.LenCup==1,'Country'].value_counts(ascending=False).rank(method='min',ascending=False)
rank.loc[rank==1].index

Index(['Brazil'], dtype='object')

In [918]:
import pandas as pd
import datetime as dt
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/bicycle/seoul_bi.csv')
df.head()

         대여일자  대여시간  대여소번호 대여구분코드 성별 연령대코드  이용건수    운동량   탄소량     이동거리  사용시간
0  2021-06-01     0   3541    정기권  F  ~10대     1   0.00  0.00     0.00     8
1  2021-06-01     0    765    정기권  F  ~10대     1  27.21  0.35  1526.81    19
2  2021-06-01     0   2637    정기권  F  ~10대     1  41.40  0.37  1608.56    18
3  2021-06-01     0   2919    정기권  F  ~10대     1   0.00  0.00     0.00    75
4  2021-06-01     0    549    정기권  F  ~10대     1  13.04  0.17   731.55     6

In [919]:
# Question 31

# 대여일자별 데이터의 수를 데이터프레임으로 출력하고, 가장 많은 데이터가 있는 날짜를 출력하라

In [920]:
rank = df['대여일자'].value_counts(ascending=False).rank(method='min',ascending=False)
answer = rank.loc[rank==1].index
result = df['대여일자'].value_counts(ascending=False).sort_index().to_frame()

display(result)
print(answer)

             대여일자
2021-06-01  48081
2021-06-02  56100
2021-06-03  18985
2021-06-04  56788
2021-06-05  52730
2021-06-06  47787
2021-06-07  52623
2021-06-08  55623
2021-06-09  54507
2021-06-10  36992
2021-06-11  52089
2021-06-12  48569
2021-06-13  43131
2021-06-14  54945

Index(['2021-06-04'], dtype='object')

In [921]:
# Question 32

# 각 일자의 요일을 표기하고 (‘Monday’ ~’Sunday’) ‘day_name’컬럼을 추가하고 
# 이를 이용하여 각 요일별 이용 횟수의 총합을 데이터 프레임으로 출력하라

In [922]:
df.head()

         대여일자  대여시간  대여소번호 대여구분코드 성별 연령대코드  이용건수    운동량   탄소량     이동거리  사용시간
0  2021-06-01     0   3541    정기권  F  ~10대     1   0.00  0.00     0.00     8
1  2021-06-01     0    765    정기권  F  ~10대     1  27.21  0.35  1526.81    19
2  2021-06-01     0   2637    정기권  F  ~10대     1  41.40  0.37  1608.56    18
3  2021-06-01     0   2919    정기권  F  ~10대     1   0.00  0.00     0.00    75
4  2021-06-01     0    549    정기권  F  ~10대     1  13.04  0.17   731.55     6

In [944]:
df['day_name'] = pd.to_datetime(df['대여일자']).apply(lambda x: x.day_name())

In [953]:
answer = df['day_name'].value_counts().to_frame()
display(answer)

           day_name
Wednesday    110607
Friday       108877
Monday       107568
Tuesday      103704
Saturday     101299
Sunday        90918
Thursday      55977

In [ ]:
# Question 33

# 각 요일별 가장 많이 이용한 대여소의 이용횟수와 대여소 번호를 데이터 프레임으로 출력하라

In [967]:
df_rental = df.groupby(['day_name'])['대여소번호'].apply(lambda x: x.value_counts(ascending=False).head(1)).reset_index()

In [973]:
df_rental.rename(columns=dict(zip(df_rental.columns,['day_name',"대여소번호","이용횟수"])))

    day_name  대여소번호  이용횟수
0     Friday    502   277
1     Monday    502   242
2   Saturday    502   378
3     Sunday    502   372
4   Thursday   2715   137
5    Tuesday    502   267
6  Wednesday    502   282

In [982]:
# Question 34

# 나이대별 대여구분 코드의 (일일권/전체횟수) 비율을 구한 후 
# 가장 높은 비율을 가지는 나이대를 확인하라. 일일권의 경우 일일권 과 일일권(비회원)을 모두 포함하라

In [983]:
df.head()

,대여일자,대여시간,대여소번호,대여구분코드,성별,연령대코드,이용건수,운동량,탄소량,이동거리,사용시간,day_name
0,2021-06-01,0,3541,정기권,F,~10대,1,0.00,0.00,0.00,8,Tuesday
1,2021-06-01,0,765,정기권,F,~10대,1,27.21,0.35,1526.81,19,Tuesday
2,2021-06-01,0,2637,정기권,F,~10대,1,41.40,0.37,1608.56,18,Tuesday
3,2021-06-01,0,2919,정기권,F,~10대,1,0.00,0.00,0.00,75,Tuesday
4,2021-06-01,0,549,정기권,F,~10대,1,13.04,0.17,731.55,6,Tuesday

In [984]:
df.대여구분코드.unique()

array(['정기권', '일일권', '단체권', '일일권(비회원)'], dtype=object)

In [986]:
df.연령대코드.unique()

array(['~10대', '20대', '30대', '40대', '50대', '60대', '70대~'], dtype=object)

In [1043]:
def ratio(df):
    return (df.loc['정기권']+df.loc['단체권'])/df.sum()
    
temp = df.groupby('연령대코드')['대여구분코드'].apply(lambda x: 1-ratio(x.value_counts()) ).to_frame()
display(temp)

         대여구분코드
연령대코드
20대    0.239913
30대    0.166702
40대    0.110585
50대    0.065414
60대    0.042462
70대~   0.048962
~10대   0.312525

In [1044]:
# Question 35
# 연령대별 평균 이동거리를 구하여라

In [1047]:
df.groupby('연령대코드')["이동거리"].mean().to_frame()

              이동거리
연령대코드
20대    3211.890552
30대    3341.443859
40대    3514.857416
50대    3593.668100
60대    3538.145737
70대~   3085.039641
~10대   2634.426279

In [1097]:
# Question 36

# 연령대 코드가 20대인 데이터를 추출하고,
# 이동거리값이 추출한 데이터의 이동거리값의 평균 이상인 데이터를 추출한다.
# 최종 추출된 데이터를 대여일자, 대여소 번호 순서로 내림차순 정렬 후 
# 1행부터 200행까지의 탄소량의 평균을 
# 소숫점 3째 자리까지 구하여라

In [1098]:
df_20s = df.loc[df.연령대코드=='20대',]
round(df.loc[df.이동거리>=df_20s['이동거리'].mean(),]\
      .sort_values(by=['대여일자','대여소번호'],ascending=False)\
      .head(200)['탄소량']\
      .astype('float')\
      .mean(),3)

1.513

In [1099]:
# Question 37

# 6월 7일 ~10대의 “이용건수”의 중앙값은?

In [1100]:
type(df.대여일자.iloc[0])

str

In [1102]:
df.loc[(df.대여일자=='2021-06-07')&(df.연령대코드=='~10대'),'이용건수'].median()

1.0

In [1103]:
# Question 38

# 평일 (월~금) 출근 시간대(오전 6,7,8시)의 대여소별 이용 횟수를 구해서 데이터 프레임 형태로 표현한 후 
# 각 대여시간별 a이용 횟수의 상위 3개 대여소와 이용횟수를 출력하라

In [1143]:
df.head()

,대여일자,대여시간,대여소번호,대여구분코드,성별,연령대코드,이용건수,운동량,탄소량,이동거리,사용시간,day_name
0,2021-06-01,0,3541,정기권,F,~10대,1,0.00,0.00,0.00,8,Tuesday
1,2021-06-01,0,765,정기권,F,~10대,1,27.21,0.35,1526.81,19,Tuesday
2,2021-06-01,0,2637,정기권,F,~10대,1,41.40,0.37,1608.56,18,Tuesday
3,2021-06-01,0,2919,정기권,F,~10대,1,0.00,0.00,0.00,75,Tuesday
4,2021-06-01,0,549,정기권,F,~10대,1,13.04,0.17,731.55,6,Tuesday

In [1150]:
temp = df.loc[(df.day_name!='Saturday')&(df.day_name!='Sunday')\
       &((df.대여시간>=6)&
         (df.대여시간<=8)),]\
.groupby('대여시간')['대여소번호']\
.apply(lambda x:x.value_counts(ascending=False).head(3)).to_frame()\
.rename(columns={'대여소번호':'이용횟수'})

temp.index.names=['대여시간','대여소번호']
temp.sort_index(ascending=True, inplace=True)
display(temp)

            이용횟수
대여시간 대여소번호
6    1028     36
     1125     40
     2744     45
7    230      77
     259     104
     726      77
8    646     115
     1152     92
     2701    119

In [1151]:
# Question 39

# 이동거리의 평균 이상의 이동거리 값을 가지는 데이터를 추출하여 추출데이터의 이동거리의 표본표준편차 값을 구하여라

In [1152]:
df.head()

,대여일자,대여시간,대여소번호,대여구분코드,성별,연령대코드,이용건수,운동량,탄소량,이동거리,사용시간,day_name
0,2021-06-01,0,3541,정기권,F,~10대,1,0.00,0.00,0.00,8,Tuesday
1,2021-06-01,0,765,정기권,F,~10대,1,27.21,0.35,1526.81,19,Tuesday
2,2021-06-01,0,2637,정기권,F,~10대,1,41.40,0.37,1608.56,18,Tuesday
3,2021-06-01,0,2919,정기권,F,~10대,1,0.00,0.00,0.00,75,Tuesday
4,2021-06-01,0,549,정기권,F,~10대,1,13.04,0.17,731.55,6,Tuesday

In [1153]:
df.loc[df['이동거리']>df['이동거리'].mean(),'이동거리'].std()

5092.139707505305

In [1154]:
# Question 40

# 남성(‘M’ or ‘m’)과 여성(‘F’ or ‘f’)의 이동거리값의 평균값을 구하여라

In [1159]:
df['성별'] = df.성별.apply(lambda x: x.lower())
df.groupby('성별')['이동거리'].mean().rename(index={'f':'여성','m':'남성'}).to_frame()

           이동거리
성별
여성  3468.575025
남성  3209.110871

In [1]:
import pandas as pd
df =pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/happy2/happiness.csv',encoding='utf-8')
df.head()

,행복랭킹,나라명,점수,상대GDP,사회적지원,행복기대치,선택의 자유도,관대함,부패에 대한인식,년도
0,1,Finland,7.769,1.340,1.587,0.986,0.596,0.153,0.393,2019
1,2,Denmark,7.600,1.383,1.573,0.996,0.592,0.252,0.410,2019
2,3,Norway,7.554,1.488,1.582,1.028,0.603,0.271,0.341,2019
3,4,Iceland,7.494,1.380,1.624,1.026,0.591,0.354,0.118,2019
4,5,Netherlands,7.488,1.396,1.522,0.999,0.557,0.322,0.298,2019

In [2]:
type(df.행복랭킹.iloc[0])

numpy.int64

In [3]:
# Question 41

# 데이터는 2018년도와 2019년도의 전세계 행복 지수를 표현한다. 각년도의 행복랭킹 10위를 차지한 나라의 행복점수의 평균을 구하여라

In [4]:
df.loc[df.행복랭킹==10,['점수']].mean()

점수    7.259
dtype: float64

In [5]:
# Question 42

# 데이터는 2018년도와 2019년도의 전세계 행복 지수를 표현한다. 
# 각년도의 행복랭킹 50위이내의 나라들의 각각의 행복점수 평균을 데이터프레임으로 표시하라

In [6]:
df.loc[df.행복랭킹<=50,].groupby('년도')['점수'].mean().to_frame()

           점수
년도
2018  6.64678
2019  6.67002

In [7]:
# Question 43

# 2018년도 데이터들만 추출하여 행복점수와 부패에 대한 인식에 대한 상관계수를 구하여라

In [8]:
df.loc[df.년도==2018,['점수','부패에 대한인식']].corr().iloc[0,1]

0.4052915227150998

In [9]:
# Question 44

# 2018년도와 2019년도의 행복랭킹이 변화하지 않은 나라명의 수를 구하여라

In [10]:
df.head()

,행복랭킹,나라명,점수,상대GDP,사회적지원,행복기대치,선택의 자유도,관대함,부패에 대한인식,년도
0,1,Finland,7.769,1.340,1.587,0.986,0.596,0.153,0.393,2019
1,2,Denmark,7.600,1.383,1.573,0.996,0.592,0.252,0.410,2019
2,3,Norway,7.554,1.488,1.582,1.028,0.603,0.271,0.341,2019
3,4,Iceland,7.494,1.380,1.624,1.026,0.591,0.354,0.118,2019
4,5,Netherlands,7.488,1.396,1.522,0.999,0.557,0.322,0.298,2019

In [11]:
df.loc[(df.나라명=='Finland')&(df.년도==2018),]

     행복랭킹      나라명     점수  상대GDP  사회적지원  행복기대치  선택의 자유도    관대함  부패에 대한인식    년도
156     1  Finland  7.632  1.305  1.592  0.874    0.681  0.202     0.393  2018

In [12]:
df.loc[(df.나라명=='Finland')&(df.년도==2019),'행복랭킹'].values[0]

1

In [13]:
df.loc[(df.나라명=='Finland')&(df.년도==2018),'행복랭킹'].values[0]

1

In [14]:
df.loc[(df.년도==2018),['나라명','행복랭킹']]

                          나라명  행복랭킹
156                   Finland     1
157                    Norway     2
158                   Denmark     3
159                   Iceland     4
160               Switzerland     5
..                        ...   ...
307                     Yemen   152
308                  Tanzania   153
309               South Sudan   154
310  Central African Republic   155
311                   Burundi   156

[156 rows x 2 columns]

In [15]:
df_2018 = pd.DataFrame(index=df.loc[(df.년도==2018),'나라명'].values, data=df.loc[(df.년도==2018),'행복랭킹'].values, columns=['행복랭킹'])

In [16]:
df_2019 = pd.DataFrame(index=df.loc[(df.년도==2019),'나라명'].values, data=df.loc[(df.년도==2019),'행복랭킹'].values, columns=['행복랭킹'])

In [17]:
df_minus= (df_2019 - df_2018)

In [18]:
df_minus.loc[df_minus['행복랭킹']==0,'행복랭킹'].value_counts().values[0]

15

In [19]:
len(df) - len(df.loc[:,['나라명','행복랭킹']].drop_duplicates())

15

In [20]:
# Question 45
# 2019년도 데이터들만 추출하여 각변수간 상관계수를 구하고
# 내림차순으로 정렬한 후 상위 5개를 데이터 프레임으로 출력하라. 컬럼명은 v1,v2,corr으로 표시하라

In [21]:
df_2019 = df.loc[df.년도==2019,'행복랭킹':'부패에 대한인식']

In [23]:
df_2019_corr = df_2019.corr()

In [63]:
df_melt = df_2019_corr.melt().replace(1,-2).sort_values(by='value',ascending=False)
df_dup = df_melt.drop_duplicates('value')
df_left = df_melt.drop(index=df_dup.index)

In [68]:
df_dup= df_dup.head(5)

In [73]:
df_merge = pd.merge(left=df_dup, right=df_left, left_on='value', right_on='value')

In [78]:
df_merge = df_merge.rename(columns=dict(zip(df_merge.columns, ['v1','corr','v2'])))

In [82]:
df_merge=df_merge.loc[:,['v1','v2','corr']]

In [83]:
df_merge

      v1     v2      corr
0  상대GDP  행복기대치  0.835462
1     점수  상대GDP  0.793883
2     점수  행복기대치  0.779883
3  사회적지원     점수  0.777058
4  상대GDP  사회적지원  0.754906

In [84]:
df_2019_corr

,행복랭킹,점수,상대GDP,사회적지원,행복기대치,선택의 자유도,관대함,부패에 대한인식
행복랭킹,1.000000,-0.989096,-0.801947,-0.767465,-0.787411,-0.546606,-0.047993,-0.351959
점수,-0.989096,1.000000,0.793883,0.777058,0.779883,0.566742,0.075824,0.385613
상대GDP,-0.801947,0.793883,1.000000,0.754906,0.835462,0.379079,-0.079662,0.298920
사회적지원,-0.767465,0.777058,0.754906,1.000000,0.719009,0.447333,-0.048126,0.181899
행복기대치,-0.787411,0.779883,0.835462,0.719009,1.000000,0.390395,-0.029511,0.295283
선택의 자유도,-0.546606,0.566742,0.379079,0.447333,0.390395,1.000000,0.269742,0.438843
관대함,-0.047993,0.075824,-0.079662,-0.048126,-0.029511,0.269742,1.000000,0.326538
부패에 대한인식,-0.351959,0.385613,0.298920,0.181899,0.295283,0.438843,0.326538,1.000000

In [101]:
df_temp = df_2019_corr.unstack().to_frame().reset_index().drop_duplicates(0).sort_values(by=0,ascending=False).iloc[1:6,]

In [104]:
#df_temp = df_temp.rename(columns=dict(zip(df_temp.columns,['v1','v2','corr'])))
df_temp.columns=['v1','v2','corr']

In [105]:
df_temp

       v1     v2      corr
20  상대GDP  행복기대치  0.835462
10     점수  상대GDP  0.793883
12     점수  행복기대치  0.779883
11     점수  사회적지원  0.777058
19  상대GDP  사회적지원  0.754906

In [106]:
# Question 46

# 각 년도별 하위 행복점수의 하위 5개 국가의 평균 행복점수를 구하여라

In [112]:
df.groupby('년도')['점수'].apply(lambda x: x.tail(5).mean()).to_frame()

          점수
년도
2018  3.1800
2019  3.1408

In [113]:
# Question 47

# 2019년 데이터를 추출하고 해당데이터의 상대 GDP 평균 이상의 나라들과 
# 평균 이하의 나라들의 행복점수 평균을 각각 구하고 그 차이값을 출력하라

In [114]:
df.head()

,행복랭킹,나라명,점수,상대GDP,사회적지원,행복기대치,선택의 자유도,관대함,부패에 대한인식,년도
0,1,Finland,7.769,1.340,1.587,0.986,0.596,0.153,0.393,2019
1,2,Denmark,7.600,1.383,1.573,0.996,0.592,0.252,0.410,2019
2,3,Norway,7.554,1.488,1.582,1.028,0.603,0.271,0.341,2019
3,4,Iceland,7.494,1.380,1.624,1.026,0.591,0.354,0.118,2019
4,5,Netherlands,7.488,1.396,1.522,0.999,0.557,0.322,0.298,2019

In [115]:
df_2019 = df.loc[df.년도==2019,]

In [120]:
abs(df_2019.loc[df_2019.상대GDP>=df_2019.상대GDP.mean(),'점수'].mean() - df_2019.loc[df_2019.상대GDP<=df_2019.상대GDP.mean(),'점수'].mean())

1.3904839572192547

In [121]:
# Question 49

# 2018년도 행복랭킹 50위 이내에 포함됐다가 2019년 50위 밖으로 밀려난 국가의 숫자를 구하여라

In [125]:
df_2018 = df.loc[(df.년도==2018) & (df.행복랭킹<=50),]

In [126]:
df_2019 = df.loc[(df.년도==2019) & (df.행복랭킹>50),]

In [133]:
pd.merge(left=df_2018, right=df_2019, left_on='나라명', right_on='나라명')

,행복랭킹_x,나라명,점수_x,상대GDP_x,사회적지원_x,행복기대치_x,선택의 자유도_x,관대함_x,부패에 대한인식_x,년도_x,행복랭킹_y,점수_y,상대GDP_y,사회적지원_y,행복기대치_y,선택의 자유도_y,관대함_y,부패에 대한인식_y,년도_y
0,35,Malaysia,6.322,1.161,1.258,0.669,0.356,0.311,0.059,2018,80,5.339,1.221,1.171,0.828,0.508,0.260,0.024,2019
1,45,Kuwait,6.083,1.474,1.301,0.675,0.554,0.167,0.106,2018,51,6.021,1.500,1.319,0.808,0.493,0.142,0.097,2019
2,46,Thailand,6.072,1.016,1.417,0.707,0.637,0.364,0.029,2018,52,6.008,1.050,1.409,0.828,0.557,0.359,0.028,2019

In [135]:
len(set(df[(df.년도==2018) & (df.행복랭킹 <=50)].나라명) - set(df[(df.년도==2019) & (df.행복랭킹 <=50)].나라명))

4

In [134]:
df.loc[df.나라명=='Belize',]

     행복랭킹     나라명     점수  상대GDP  사회적지원  행복기대치  선택의 자유도    관대함  부패에 대한인식    년도
204    49  Belize  5.956  0.807  1.101  0.474    0.593  0.183     0.089  2018

In [136]:
# Question 50

# 2018년,2019년 모두 기록이 있는 나라들 중 년도별 행복점수가 가장 증가한 나라와 그 증가 수치는?

In [202]:
df.shape

(312, 10)

In [214]:
df_one = set(df[(df.년도==2018)].나라명) & set(df[(df.년도==2019)].나라명)

In [252]:
df_filtered = df[df['나라명'].isin(df_one)]
df_2019 = df_filtered.loc[df.년도==2019,].sort_values(by='나라명',ascending=True).reset_index(drop=True)
df_2018 = df_filtered.loc[df.년도==2018,].sort_values(by='나라명',ascending=True).reset_index(drop=True)
df_2019['2018_점수차'] = df_2019.점수-df_2018.점수
(df_2019.sort_values(by='2018_점수차',ascending=False).head(1))[['나라명','2018_점수차']]

        나라명  2018_점수차
20  Burundi      0.87

In [253]:
import pandas as pd
df= pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/consum/Tetuan%20City%20power%20consumption.csv')
df.head()

,DateTime,Temperature,Humidity,Wind Speed,general diffuse flows,diffuse flows,Zone 1 Power Consumption,Zone 2 Power Consumption,Zone 3 Power Consumption
0,1/1/2017 0:00,6.559,73.8,0.083,0.051,0.119,34055.69620,16128.87538,20240.96386
1,1/1/2017 0:10,6.414,74.5,0.083,0.070,0.085,29814.68354,19375.07599,20131.08434
2,1/1/2017 0:20,6.313,74.5,0.080,0.062,0.100,29128.10127,19006.68693,19668.43373
3,1/1/2017 0:30,6.121,75.0,0.083,0.091,0.096,28228.86076,18361.09422,18899.27711
4,1/1/2017 0:40,5.921,75.7,0.081,0.048,0.085,27335.69620,17872.34043,18442.40964

In [256]:
type(df.DateTime.iloc[0])

str

In [258]:
df.DateTime = pd.to_datetime(df.DateTime)

In [259]:
type(df.DateTime.iloc[0])

pandas._libs.tslibs.timestamps.Timestamp

In [261]:
import datetime as dt

In [265]:
df['month']=df.DateTime.dt.month

In [268]:
df.month.value_counts().to_frame().sort_index()

    month
1    4464
2    4032
3    4464
4    4320
5    4464
6    4320
7    4464
8    4464
9    4320
10   4464
11   4320
12   4320

In [269]:
# Question 52

# 3월달의 각 시간대별 온도의 평균들 중 가장 낮은 시간대의 온도를 출력하라

In [270]:
df['hour']=df.DateTime.dt.hour

In [282]:
df.month==3

0        False
1        False
2        False
3        False
4        False
         ...
52411    False
52412    False
52413    False
52414    False
52415    False
Name: month, Length: 52416, dtype: bool

In [284]:
df.loc[df.month==3,:].groupby(['hour'])['Temperature'].mean().sort_values(ascending=True).head(1).values[0]

11.506612903225806

In [ ]:
# Question 53

# 3월달의 각 시간대별 온도의 평균들 중 가장 높은 시간대의 온도를 출력하라

In [285]:
df.loc[df.month==3,:].groupby(['hour'])['Temperature'].mean().sort_values(ascending=False).head(1).values[0]

18.39360215053763

In [287]:
# Question 54

# Zone 1 Power Consumption 컬럼의 value값의 크기가 
# Zone 2 Power Consumption 컬럼의 value값의 크기보다 큰 데이터들의 Humidity의 평균을 구하여라

In [288]:
df.head()

,DateTime,Temperature,Humidity,Wind Speed,general diffuse flows,diffuse flows,Zone 1 Power Consumption,Zone 2 Power Consumption,Zone 3 Power Consumption,month,hour
0,2017-01-01 00:00:00,6.559,73.8,0.083,0.051,0.119,34055.69620,16128.87538,20240.96386,1,0
1,2017-01-01 00:10:00,6.414,74.5,0.083,0.070,0.085,29814.68354,19375.07599,20131.08434,1,0
2,2017-01-01 00:20:00,6.313,74.5,0.080,0.062,0.100,29128.10127,19006.68693,19668.43373,1,0
3,2017-01-01 00:30:00,6.121,75.0,0.083,0.091,0.096,28228.86076,18361.09422,18899.27711,1,0
4,2017-01-01 00:40:00,5.921,75.7,0.081,0.048,0.085,27335.69620,17872.34043,18442.40964,1,0

In [291]:
df.loc[df["Zone 1 Power Consumption"]>df["Zone 2  Power Consumption"],'Humidity'].mean()

68.23624448055094

In [292]:
df[["Zone 1 Power Consumption", "Zone 2  Power Consumption", "Zone 3  Power Consumption"]].corr()

,Zone 1 Power Consumption,Zone 2 Power Consumption,Zone 3 Power Consumption
Zone 1 Power Consumption,1.000000,0.834519,0.750733
Zone 2 Power Consumption,0.834519,1.000000,0.570932
Zone 3 Power Consumption,0.750733,0.570932,1.000000

In [293]:
# Question 56

# Temperature의 값이 10미만의 경우 A, 
# 10이상 20미만의 경우 B, 
# 20이상 30미만의 경우 C, 
# 그 외의 경우 D라고 할때 
# 각 단계의 데이터 숫자를 구하여라

In [307]:
bins = list(range(10,40,10))

In [308]:
bins.insert(0, df["Temperature"].min())

In [309]:
bins.insert(len(bins),df["Temperature"].max())

In [310]:
bins

[3.247, 10, 20, 30, 40.01]

In [311]:
category = ['A','B','C','D']

In [313]:
pd.cut(df["Temperature"],bins=bins, labels=category).value_counts()

B    27009
C    21080
A     2889
D     1437
Name: Temperature, dtype: int64

In [314]:
# Question 57

# 6월 데이터중 12시의 Temperature의 표준편차를 구하여라

In [316]:
df.loc[(df.month==6) &(df.hour==12),'Temperature'].std()

2.049941782795103

In [317]:
# Question 58

# 6월 데이터중 12시의 Temperature의 분산을 구하여라

In [318]:
df.loc[(df.month==6) &(df.hour==12),'Temperature'].var()

4.202261312849164

In [319]:
# Question 59

# Temperature의 평균이상의 Temperature의 값을 가지는 데이터를 Temperature를 기준으로 정렬 했을때 4번째 행의 Humidity 값은?

In [328]:
(df.loc[df.Temperature>=df.Temperature.mean(),].sort_values(by='Temperature')).reset_index(drop=True).iloc[3,2]

87.9

In [329]:
#Question 60

#Temperature의 중간값 이상의 Temperature의 값을 가지는 데이터를Temperature를 기준으로 정렬 했을때 4번째 행의 Humidity 값은?

In [346]:
df.loc[df.Temperature>=df.Temperature.median(),].sort_values(by='Temperature',ascending=True).reset_index(drop=True).iloc[3,2]

80.3

In [347]:
df.loc[df.Temperature>=df.Temperature.median(),].sort_values(by='Temperature',ascending=True).Humidity.values[3]

80.3

In [414]:
import pandas as pd
df = pd.read_csv('https://raw.githubusercontent.com/Datamanim/datarepo/main/pok/Pokemon.csv')
df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [349]:
# Question 61

# Legendary 컬럼은 전설포켓몬 유무를 나타낸다.전설포켓몬과 그렇지 않은 포켓몬들의 HP평균의 차이를 구하여라

In [350]:
abs(df.loc[df.Legendary==True,'HP'].mean()-df.loc[df.Legendary==False,'HP'].mean())

25.55614861329147

In [351]:
# Question 62

# Type 1은 주속성 Type 2 는 부속성을 나타낸다. 가장 많은 부속성 종류는 무엇인가?

In [355]:
df['Type 2'].value_counts().head(1).index[0]

'Flying'

In [356]:
# Question 63

# 가장 많은 Type 1 의 종의 평균 Attack 을 평균 Defense로 나눈값은?

In [366]:
df.loc[df['Type 1']==(df['Type 1'].value_counts().head(1).index[0]),['Attack','Defense']]

     Attack  Defense
9        48       65
10       63       80
11       83      100
12      103      120
59       52       48
..      ...      ...
724      56       40
725      63       52
726      95       67
762      53       62
763      73       88

[112 rows x 2 columns]

In [375]:
df_type1 = df.loc[df['Type 1']==(df['Type 1'].value_counts().head(1).index[0]),]

In [376]:
df_type1.Attack.mean()/df_type1.Defense.mean()

1.0165238678090576

In [402]:
df_type1 = df.loc[df['Type 1']==(df['Type 1'].value_counts().head(1).index[0]),['Attack','Defense']].apply(lambda x: x.mean())
df_type1.loc['Attack']/df_type1.loc['Defense']

1.0165238678090576

In [409]:
# Question 64

# 포켓몬 세대(Generation) 중 가장많은 Legendary를 보유한 세대는 몇세대인가?

In [464]:
df_group = df.groupby(['Generation'])['Legendary'].value_counts().unstack()
df_group.iloc[:,1].sort_values(ascending=False).head().index[0]

3

In [465]:
df.loc[df['Legendary']==True,'Generation'].value_counts(ascending=False).head(1).index[0]

3

In [466]:
# Question 65

# ‘HP’, ‘Attack’, ‘Defense’, ‘Sp. Atk’, ‘Sp. Def’, ‘Speed’ 간의 상관 계수중 가장 절댓값이 큰 두 변수와 그 값을 구하여라

In [479]:
df_unstack = df[['HP','Attack','Defense', 'Sp. Atk','Sp. Def','Speed']].corr().unstack().to_frame()

In [481]:
df_unstack.columns=['corr']

In [504]:
df_unstack.loc[df_unstack['corr']!=1,'corr'].sort_values(ascending=False).to_frame().iloc[0]

corr    0.510747
Name: (Defense, Sp. Def), dtype: float64

In [505]:
# Question 66

# 각 Generation의 Attack으로 오름차순 정렬시 상위 3개 데이터들(18개)의 Attack의 전체 평균을 구하여라

In [506]:
df.head()

,#,Name,Type 1,Type 2,Total,HP,Attack,Defense,Sp. Atk,Sp. Def,Speed,Generation,Legendary
0,1,Bulbasaur,Grass,Poison,318,45,49,49,65,65,45,1,False
1,2,Ivysaur,Grass,Poison,405,60,62,63,80,80,60,1,False
2,3,Venusaur,Grass,Poison,525,80,82,83,100,100,80,1,False
3,3,VenusaurMega Venusaur,Grass,Poison,625,80,100,123,122,120,80,1,False
4,4,Charmander,Fire,NaN,309,39,52,43,60,50,65,1,False

In [524]:
df.groupby(['Generation'])['Attack'].apply(lambda x: x.sort_values(ascending=True).iloc[0:3]).to_frame().mean().values[0]

19.5

In [522]:
# Question 67
# 각 Generation의 Attack으로 내림차순 정렬시 상위 5개 데이터들(30개)의 Attack의 전체 평균을 구하여라

In [525]:
df.groupby(['Generation'])['Attack'].apply(lambda x: x.sort_values(ascending=False).iloc[0:5]).to_frame().mean().values[0]

157.23333333333332

In [526]:
# Question 68

# 가장 흔하게 발견되는 (Type1 , Type2) 의 쌍은 무엇인가?

In [537]:
pd.crosstab(df['Type 1'], df['Type 2']).unstack().sort_values(ascending=False).head(1).index

MultiIndex([('Flying', 'Normal')],
           names=['Type 2', 'Type 1'])

In [538]:
# Question 69

# 한번씩만 존재하는 (Type1 , Type2)의 쌍의 갯수는 몇개인가?

In [541]:
df_cross = pd.crosstab(df['Type 1'], df['Type 2']).unstack().to_frame()

In [544]:
df_cross.columns=['counts']

In [547]:
df_cross.loc[df_cross.counts==1,].shape[0]

39

In [548]:
# Question 70

# 한번씩만 존재하는 (Type1 , Type2)의 쌍을 각 세대(Generation)은 각각 몇개씩 가지고 있는가?